/*
		비트연산자
			. 논리연산자와 비슷하나 하는 일은 완전히 다름
			. 비트를 사용해서 연산하는 연산자이다.
			. 정수와 정수형태의 연산만 가능하다.
			
			. AND(&) : 	1 1 ---> 1
			. OR(|)  :  0 0 ---> 0
			. XOR(^) :  0 0 ---> 0, 	1 1 --> 0,	0 1 --> 1,	1 0 --> 1 (다르면 1)   

*/
package C5_Operator;

public class Operator7 {
	public static void main(String[] args) {
	
		
		int n1 = 10 ;			// 1
		int n2 = 5 ;
		int result = n1 & n2;
		
		//비트연산자 계산
		/*				16	8	4	2	1
		 * --------------------------------
		 * n1 10 		0	1	0	1	0
		 * n2 5			0	0	1	0	1
		 * --------------------------------
		 * &			0 	0	0	0	0
		
		*/
		System.out.println(result);
		
		result = n1 | n2;
		
		//비트연산자 계산
		/*				16	8	4	2	1
		 * --------------------------------
		 * n1 10 		0	1	0	1	0
		 * n2 5			0	0	1	0	1
		 * --------------------------------
		 * |			0 	1	1	1	1
		 * 
		*/
		System.out.println(result);
		
		result = n1 ^ n2;
		//비트연산자 계산
			/*				16	8	4	2	1
			 * --------------------------------
			 * n1 10 		0	1	0	1	0
			 * n2 5			0	0	1	0	1				 
			 * --------------------------------
			 * |			0 	1	1	1	1
			 * 
				*/
		System.out.println(result);
	}
	
}
